// ==UserScript==
// @name			Comicslate NoteSorter
// @version			2020.07.17
// @description		Сортировка наклеек
// @match			*://*comicslate.org/*do=edit*
// @exclude			http*://browsershots.org/*
// @icon			https://www.google.com/s2/favicons?domain=comicslate.org
// @author			Rainbow-Spike
// @grant			none
// ==/UserScript==

var wiki_text = document.querySelector ( '#wiki__text' );

if ( wiki_text != null ) {
	var parts = wiki_text.textContent.split ( '@' ), // разделение и зачистка
/*
0: "== Freefall 0884 ==\n**Запуск**\n\n{cnav}\n{{cotan&gt;0884.jpg}}\n"
1: "0,0,182,116\n[sam]Активированы водяные насосы высокого давления. Так и должно быть?\n~\n"
2: "15,183,148,74\n[flo]Да. Это наши промежуточные двигательные системы.\n~\n"
3: "0,374,265,118\n[flo]Когда мы поднимаемся уже достаточно высоко, но не настолько, чтобы запустить магнитные поглотители индукторных двигателей, мы используем воду в качестве реактивной массы.\n~\n"
4: "0,686,282,140\n[sam]Хммм. Имея ядерный реактор и стартовую систему на магнитных ускорителях, я ожидал полёта на чём-то более современном, чем космический пароход.\n~\n"
5: "7,688,269,103\n#\n~\n"
6: "106,721,201,25\n#\n~\n"
7: "6,375,263,104\n#\n~\n"
8: "22,197,124,48\n#\n~\n"
9: "63,221,77,23\n#\n~\n"
10: "10,39,103,100\n#\n~\n"
11: "30,12,157,62\n#\n~\n{{&lt;cotan}}\n{cnav}"
*/
		begin = parts.slice ( 0 , 1 ),
/*
0: "== Freefall 0884 ==\n**Запуск**\n\n{cnav}\n{{cotan&gt;0884.jpg}}\n"
*/
		notes = parts.slice ( 1 ),
/*
0: "0,0,182,116\n[sam]Активированы водяные насосы высокого давления. Так и должно быть?\n~\n"
1: "15,183,148,74\n[flo]Да. Это наши промежуточные двигательные системы.\n~\n"
2: "0,374,265,118\n[flo]Когда мы поднимаемся уже достаточно высоко, но не настолько, чтобы запустить магнитные поглотители индукторных двигателей, мы используем воду в качестве реактивной массы.\n~\n"
3: "0,686,282,140\n[sam]Хммм. Имея ядерный реактор и стартовую систему на магнитных ускорителях, я ожидал полёта на чём-то более современном, чем космический пароход.\n~\n"
4: "7,688,269,103\n#\n~\n"
5: "106,721,201,25\n#\n~\n"
6: "6,375,263,104\n#\n~\n"
7: "22,197,124,48\n#\n~\n"
8: "63,221,77,23\n#\n~\n"
9: "10,39,103,100\n#\n~\n"
10: "30,12,157,62\n#\n~\n{{&lt;cotan}}\n{cnav}"
*/
		num = parts.length - 2,
/* 10 */
		end = '{{' + notes [ num ].split ( '{{' ) [ 1 ],
/*
{{&lt;cotan}}\n{cnav}
*/
		centers = [ ],
		borders = [ ];
	notes [ num ] = notes [ num ].split ( '{{' ) [ 0 ];
/* notes:
0: "0,0,182,116\n[sam]Активированы водяные насосы высокого давления. Так и должно быть?\n~\n"
1: "15,183,148,74\n[flo]Да. Это наши промежуточные двигательные системы.\n~\n"
2: "0,374,265,118\n[flo]Когда мы поднимаемся уже достаточно высоко, но не настолько, чтобы запустить магнитные поглотители индукторных двигателей, мы используем воду в качестве реактивной массы.\n~\n"
3: "0,686,282,140\n[sam]Хммм. Имея ядерный реактор и стартовую систему на магнитных ускорителях, я ожидал полёта на чём-то более современном, чем космический пароход.\n~\n"
4: "7,688,269,103\n#\n~\n"
5: "106,721,201,25\n#\n~\n"
6: "6,375,263,104\n#\n~\n"
7: "22,197,124,48\n#\n~\n"
8: "63,221,77,23\n#\n~\n"
9: "10,39,103,100\n#\n~\n"
10: "30,12,157,62\n#\n~\n" */

	for ( var i = 0; i <= num; i++ ) { // создание списков
		var nparts = notes [ i ].split ( '\n' ),
			coords = nparts [ 0 ].split ( ',', 4 ),
/*
0,0,182,116
15,183,148,74
0,374,265,118
0,686,282,140
7,688,269,103
106,721,201,25
6,375,263,104
22,197,124,48
63,221,77,23
10,39,103,100
30,12,157,62
*/
			mark = nparts [ 1 ].charAt(0);
		if ( mark == '#' ) { // для фонов
			var center = [];
			center.push ( i ); // изначальный notes-номер
			center.push ( i ); // сортировочный номер
			center.push ( Math.round ( coords [ 1 ] * 1 + coords [ 2 ] / 2 ) ); // центр фона по x
			center.push ( Math.round ( coords [ 0 ] * 1 + coords [ 3 ] / 2 ) ); // центр фона по y
			centers.push ( center );
/*
4, 4, 823, 59
5, 5, 822, 119
6, 6, 507, 58
7, 7, 259, 46
8, 8, 260, 75
9, 9, 91, 60
10, 10, 91, 61
*/
		} else { // для текстов
			var border = [];
			border.push ( i ); // аналогично
			border.push ( ( i + 1 ) * 100 );
			border.push ( coords [ 1 ] * 1 ); // левая граница
			border.push ( coords [ 1 ] * 1 + coords [ 2 ] * 1 ); // правая
			border.push ( coords [ 0 ] * 1 ); // верхняя
			border.push ( coords [ 0 ] * 1 + coords [ 3 ] * 1 ); // нижняя
			borders.push ( border );
/*
0, 100, 0, 182, 0, 116
1, 200, 183, 331, 15, 89
2, 300, 374, 639, 0, 118
3, 400, 686, 968, 0, 140
*/
		}
	}
	for ( var k = 0; k < borders.length; k++ ) { // проверка на вхождение центра фона в область действия текста
		for ( var j = 0; j < centers.length; j++ ) {
        	if (
				(
					( centers [ j ] [ 2 ] > borders [ k ] [ 2 ] ) // центр фона правее левой границы текста
					&&
					( centers [ j ] [ 2 ] < borders [ k ] [ 3 ] ) // левее правой
				)
				&&
				(
					( centers [ j ] [ 3 ] > borders [ k ] [ 4 ] ) // ниже верхней
					&&
					( centers [ j ] [ 3 ] < borders [ k ] [ 5 ] ) // выше нижней
				)
			) {
				centers [ j ] [ 1 ] = borders [ k ] [ 1 ] - 1; // сортировка фона за текст
				borders [ k ] [ 1 ] = borders [ k ] [ 1 ] + 1; // сдвиг текста
/* centers
4, 399, 823, 59
5, 400, 822, 119
6, 299, 507, 58
7, 199, 259, 46
8, 200, 260, 75
9, 99, 91, 60
10, 100, 91, 61
borders
0, 102, 0, 182, 0, 116
1, 202, 183, 331, 15, 89
2, 301, 374, 639, 0, 118
3, 402, 686, 968, 0, 140
*/
        	}
    	}
	}
	var end_array = [ ].concat ( centers, borders );
/*
4, 399, 823, 59
5, 400, 822, 119
6, 299, 507, 58
7, 199, 259, 46
8, 200, 260, 75
9, 99, 91, 60
10, 100, 91, 61
0, 102, 0, 182, 0, 116
1, 202, 183, 331, 15, 89
2, 301, 374, 639, 0, 118
3, 402, 686, 968, 0, 140
*/
	end_array.sort (
		function ( a, b ) {
			if ( a [ 1 ] < b [ 1 ] ) {
				return 0;
			} else if ( a [ 1 ] > b [ 1 ] ) {
				return 1;
			} else {
				return 0;
			}
		}
	)
/*
9, 99, 91, 60
10, 100, 91, 61
0, 102, 0, 182, 0, 116
7, 199, 259, 46
8, 200, 260, 75
1, 202, 183, 331, 15, 89
6, 299, 507, 58
2, 301, 374, 639, 0, 118
4, 399, 823, 59
5, 400, 822, 119
3, 402, 686, 968, 0, 140
*/
	var new_notes = [ ];
	for ( var l = 0; l < end_array.length; l++ ) {
		new_notes [ l ] = notes [ end_array [ l ] [ 0 ] ];
	}
/* new_notes [ ]
9: "10,39,103,100\n#\n~\n"
10: "30,12,157,62\n#\n~\n"
0: "0,0,182,116\n[sam]Активированы водяные насосы высокого давления. Так и должно быть?\n~\n"
7: "22,197,124,48\n#\n~\n"
8: "63,221,77,23\n#\n~\n"
1: "15,183,148,74\n[flo]Да. Это наши промежуточные двигательные системы.\n~\n"
6: "6,375,263,104\n#\n~\n"
2: "0,374,265,118\n[flo]Когда мы поднимаемся уже достаточно высоко, но не настолько, чтобы запустить магнитные поглотители индукторных двигателей, мы используем воду в качестве реактивной массы.\n~\n"
4: "7,688,269,103\n#\n~\n"
5: "106,721,201,25\n#\n~\n"
3: "0,686,282,140\n[sam]Хммм. Имея ядерный реактор и стартовую систему на магнитных ускорителях, я ожидал полёта на чём-то более современном, чем космический пароход.\n~\n"
*/
	wiki_text.value = begin + '@' + new_notes.join ( '@' ) + end;
}
